Repository: nimrod-cohen/another-custom-login
Catalog: languages/another-custom-login-*.po
Languages: he_il

source: Lost your password?
he_il: איבדת את הסיסמא שלך?

source: Password
he_il: סיסמא

source: Remember Me
he_il: זכור אותי במחשב זה

source: Username or Email
he_il: שם משתמש או אימייל

source: Username
he_il: שם משתמש

source: ← Back to
he_il: ← חזרה אל

source: Email Address
he_il: כתובת אימייל

source: Get New Password
he_il: שלח לי סיסמא חדשה

source: Please enter your email address. You will receieve a link to create a new password via email
he_il: אנא הזן את כתובת הדוא״ל שלך. נשלח לך מיד קישור כדי ליצור סיסמה חדשה

source: Confirm new password
he_il: וידוא סיסמא חדשה

source: Enter your new password below
he_il: הזן את הסיסמה החדשה שלך למטה.

source: Log in
he_il: התחבר

source: New password
he_il: סיסמא חדשה

source: Reset Password
he_il: איפוס סיסמה

source: Strength indicator
he_il: עוצמת הסיסמה

source: Hint: Strong passwords should be at least seven characters long. To make it stronger, use upper and lower case letters, numbers and symbols like ! “ ? $ % ^ & )
he_il: רמז: הסיסמא צריכה להיות באורך של לפחות שבעה תווים. כדי להפוך אותה לחזקה יותר, השתמשו באותיות גדולות וקטנות, מספרים וסימנים כמו ! “ ? $ % ^ & )

source: Someone has requested a password reset for the following account:
he_il: מישהו ביקש שיאפסו לו את הסיסמה מהסיבה הבאה:

source: Username: %s
he_il: שם משתמש:%s

source: If this was a mistake, just ignore this email and nothing will happen.
he_il: אם לא רצית לאפס את סיסמתך, התעלם מהודעה זו ושום דבר לא יקרה.

source: To reset your password, visit the following address:
he_il: על מנת לאפס את הסיסמא, בקר בכתובת הבאה:

source: [%s] Password Reset
he_il: [%s] איפוס סיסמה

source: Password is empty
he_il: השדה ‘סיסמה ‘ ריק.

source: Passwords mismatch
he_il: הסיסמאות אינן תואמות

source: Password changed successfully
he_il: סיסמתך שונתה בהצלחה

source: Invalid login or email address, or address does not exist
he_il: משתמש לא חוקי או כתובת אימייל שאינה קיימת

source: Check your email for a link to reset your password
he_il: בדוק את הדואר האלקטרוני שלך עבור קישור לאיפוס הסיסמה שלך
